/***************************Copyright BestFu ***********************************
**  文    件：  WTC6216.c
**  功    能：  <<驱动层>> 六按键触摸芯片WTC6216驱动
**  编    译：  Keil uVision5 V5.10
**  版    本：  V1.0
**  编    写：  Seven
**  创建日期：  2014.08.18
**  修改日期：  2014.08.18
**  说    明：  
**  V1.0
    >> WTC6106BSI-L  六通道触摸芯片
*******************************************************************************/
#include "WTC6106.h"
#include "delay.h"
#include "sys.h"

/*******************************************************************************
**函    数： WTC6216_PortInit
**功    能： WTC6216端口初始化
**参    数： void
**返    回： void
*******************************************************************************/
void WTC6106_PortInit(void)
{
	GPIOx_Cfg(PORT_WTC_DATA, DATA1|DATA2|DATA3|DATA4|DATA5|DATA6, IN_UP);
}

/*******************************************************************************
**函    数： WTC6216_ReadKey
**功    能： 读取一次按键状态
**参    数： void
**返    回： 按键状态
*******************************************************************************/
u8 WTC6106_ReadKey(void) 
{
    return (GPIO_WTC_DATA->IDR&0x7E)>>1;
}

/***************************Copyright BestFu **********************************/
